# Brewfile for cloudartisan dotfiles
# Managed by brew bundle

# -----------------------------------------------------------------------------
# Programming Languages & Development Environments
# -----------------------------------------------------------------------------
brew "node", desc: "Platform built on V8 to build network applications"
brew "go", desc: "Open source programming language to build simple/reliable/efficient software"
brew "mono", desc: "Cross platform, open source .NET development framework"
brew "openjdk", desc: "Development kit for the Java programming language"
brew "rust", desc: "Safe, concurrent, practical language"
brew "python3", desc: "Interpreted, interactive, object-oriented programming language"
brew "python-setuptools", desc: "Easily download, build, install, upgrade, and uninstall Python packages"

# -----------------------------------------------------------------------------
# Shell Enhancements & Environment Management
# -----------------------------------------------------------------------------
brew "direnv", desc: "Load/unload environment variables based on $PWD"
brew "starship", desc: "Cross-shell prompt for astronauts"
brew "zsh-autosuggestions", desc: "Fish-like autosuggestions for zsh"
brew "zsh-syntax-highlighting", desc: "Fish-like syntax highlighting for zsh"
brew "hugo", desc: "Configurable static site generator"

# -----------------------------------------------------------------------------
# Development Tools & Utilities
# -----------------------------------------------------------------------------
brew "automake", desc: "Tool for generating GNU Standards-compliant Makefiles"
brew "cmake", desc: "Cross-platform make (required to build YouCompleteMe's ycmd)"
cask "claude", desc: "Claude AI desktop assistant"
brew "ctags", desc: "Reimplementation of ctags(1)"
brew "gnupg", desc: "GNU Pretty Good Privacy (PGP) package"
brew "pinentry-mac", desc: "Pinentry for GPG on macOS"
brew "gh", desc: "GitHub command-line tool"
brew "gist", desc: "Command-line utility for uploading Gists"
brew "git-filter-repo", desc: "Quickly rewrite git repository history"
brew "jq", desc: "Lightweight and flexible command-line JSON processor"
brew "pre-commit", desc: "Framework for managing multi-language pre-commit hooks"
brew "ripgrep", desc: "Search tool like grep and The Silver Searcher"
brew "uv", desc: "Extremely fast Python package installer and resolver"
brew "vim", desc: "Vi 'workalike' with many additional features"
brew "tmux", desc: "Terminal multiplexer"

# -----------------------------------------------------------------------------
# Networking Tools
# -----------------------------------------------------------------------------
brew "autossh", desc: "Automatically restart SSH sessions and tunnels"
brew "rsync", desc: "Utility that provides fast incremental file transfer"
brew "speedtest-cli", desc: "Command-line interface for testing internet bandwidth"
brew "wget", desc: "Internet file retriever"

# -----------------------------------------------------------------------------
# System & File Utilities
# -----------------------------------------------------------------------------
brew "tree", desc: "Display directories as trees (with optional color/HTML output)"
brew "unar", desc: "Command-line unarchiving tools supporting multiple formats"
brew "watch", desc: "Executes a program periodically, showing output fullscreen"

# -----------------------------------------------------------------------------
# Media Libraries & Tools
# -----------------------------------------------------------------------------
brew "ffmpeg", desc: "Play, record, convert, and stream audio and video"
brew "imagemagick", desc: "Tools and libraries to manipulate images in many formats"
brew "jpeg", desc: "Image manipulation library"
brew "tesseract", desc: "OCR (Optical Character Recognition) engine"
brew "tesseract-lang", desc: "Traineddata files for the tesseract OCR engine"

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-meslo-for-powerline", desc: "Meslo font patched for Powerline"
cask "font-inconsolata", desc: "Monospace font designed for code listings"
cask "font-inconsolata-dz-for-powerline", desc: "Inconsolata-dz font patched for Powerline"

# -----------------------------------------------------------------------------
# Communication & Collaboration
# -----------------------------------------------------------------------------
cask "discord", desc: "Voice and text chat software"
cask "slack", desc: "Team communication and collaboration tool"
cask "signal", desc: "Instant messaging application focusing on security"
cask "telegram", desc: "Messaging app focusing on speed and security"
cask "whatsapp", desc: "Desktop client for WhatsApp"

# -----------------------------------------------------------------------------
# Development Applications
# -----------------------------------------------------------------------------
cask "docker", desc: "App to build and share containerized applications"
cask "iterm2", desc: "Terminal emulator as alternative to Apple's Terminal app"

# -----------------------------------------------------------------------------
# Utilities & Applications
# -----------------------------------------------------------------------------
cask "1password", desc: "Password manager"
cask "google-chrome", desc: "Web browser"
cask "google-drive", desc: "Client for the Google Drive storage service"
cask "minecraft", desc: "Sandbox game of building blocks and adventure"
cask "obsidian", desc: "Knowledge base that works on local Markdown files"
