# Brewfile for cloudartisan dotfiles
# Managed by brew bundle

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# -----------------------------------------------------------------------------
# Programming Languages & Development Environments
# -----------------------------------------------------------------------------
brew "python3", desc: "Interpreted, interactive, object-oriented programming language"
brew "python-setuptools", desc: "Easily download, build, install, upgrade, and uninstall Python packages"

# -----------------------------------------------------------------------------
# Shell Enhancements & Environment Management
# -----------------------------------------------------------------------------
brew "autoenv", desc: "Per-project, per-directory shell environments"
brew "direnv", desc: "Load/unload environment variables based on $PWD"
brew "bash-completion@2", desc: "Programmable completion for Bash 4.2+"
brew "brew-cask-completion", desc: "Fish completion for brew-cask"
brew "django-completion", desc: "Bash completion for Django"
brew "docker-completion", desc: "Bash, Zsh and Fish completion for Docker"
brew "maven-completion", desc: "Bash completion for Maven"
brew "pip-completion", desc: "Bash completion for Pip"
brew "tmuxinator-completion", desc: "Shell completion for Tmuxinator"
brew "vagrant-completion", desc: "Bash completion for Vagrant"

# -----------------------------------------------------------------------------
# Development Tools & Utilities
# -----------------------------------------------------------------------------
brew "automake", desc: "Tool for generating GNU Standards-compliant Makefiles"
brew "ctags", desc: "Reimplementation of ctags(1)"
brew "gh", desc: "GitHub command-line tool"
brew "gist", desc: "Command-line utility for uploading Gists"
brew "git-filter-repo", desc: "Quickly rewrite git repository history"
brew "hub", desc: "Add GitHub support to git on the command-line"
brew "jq", desc: "Lightweight and flexible command-line JSON processor"
brew "pre-commit", desc: "Framework for managing multi-language pre-commit hooks"
brew "vim", desc: "Vi 'workalike' with many additional features"
brew "tmux", desc: "Terminal multiplexer"

# -----------------------------------------------------------------------------
# Cloud & Infrastructure Tools
# -----------------------------------------------------------------------------
brew "awscli", desc: "Official Amazon AWS command-line interface"
brew "heroku", desc: "Everything you need to get started with Heroku"
brew "kubectl", desc: "Kubernetes command-line interface"
brew "tfenv", desc: "Terraform version manager"
brew "colima", desc: "Container runtimes on MacOS with minimal setup"

# -----------------------------------------------------------------------------
# Networking Tools
# -----------------------------------------------------------------------------
brew "autossh", desc: "Automatically restart SSH sessions and tunnels"
brew "rsync", desc: "Utility that provides fast incremental file transfer"
brew "speedtest-cli", desc: "Command-line interface for testing internet bandwidth"
brew "wget", desc: "Internet file retriever"

# -----------------------------------------------------------------------------
# System & File Utilities
# -----------------------------------------------------------------------------
brew "tree", desc: "Display directories as trees (with optional color/HTML output)"
brew "unar", desc: "Command-line unarchiving tools supporting multiple formats"
brew "unrar", desc: "Extract, view, and test RAR archives"
brew "watch", desc: "Executes a program periodically, showing output fullscreen"

# -----------------------------------------------------------------------------
# Media Libraries & Tools
# -----------------------------------------------------------------------------
brew "ffmpeg", desc: "Play, record, convert, and stream audio and video"
brew "imagemagick", desc: "Tools and libraries to manipulate images in many formats"
brew "jpeg", desc: "Image manipulation library"
brew "tesseract", desc: "OCR (Optical Character Recognition) engine"
brew "tesseract-lang", desc: "Traineddata files for the tesseract OCR engine"

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-meslo-for-powerline", desc: "Meslo font patched for Powerline"
cask "font-inconsolata-dz", desc: "Inconsolata font variant with straight quotes"
cask "font-inconsolata-dz-for-powerline", desc: "Inconsolata-dz font patched for Powerline"

# -----------------------------------------------------------------------------
# Communication & Collaboration
# -----------------------------------------------------------------------------
cask "discord", desc: "Voice and text chat software"
cask "slack", desc: "Team communication and collaboration tool"
cask "signal", desc: "Instant messaging application focusing on security"
cask "telegram", desc: "Messaging app focusing on speed and security"
cask "whatsapp", desc: "Desktop client for WhatsApp"

# -----------------------------------------------------------------------------
# Development Applications
# -----------------------------------------------------------------------------
cask "cmake", desc: "Cross-platform make"
cask "docker", desc: "App to build and share containerized applications"
cask "intellij-idea", desc: "Java IDE by JetBrains"
cask "iterm2", desc: "Terminal emulator as alternative to Apple's Terminal app"
cask "ngrok", desc: "Reverse proxy, secure tunnels to localhost"
cask "postman", desc: "API development environment"
cask "vagrant", desc: "Development environment"

# -----------------------------------------------------------------------------
# Cloud Services & Storage
# -----------------------------------------------------------------------------
cask "google-cloud-sdk", desc: "Tools for the Google Cloud Platform"
cask "google-drive-file-stream", desc: "Client for the Google Drive storage service"
cask "synology-cloud-station-drive", desc: "Cloud file syncing by Synology"

# -----------------------------------------------------------------------------
# Utilities & Applications
# -----------------------------------------------------------------------------
cask "1password", desc: "Password manager"
cask "google-chrome", desc: "Web browser"
cask "kindle", desc: "Ebook reader"
cask "minecraft", desc: "Sandbox game of building blocks and adventure"
cask "send-to-kindle", desc: "Tool for sending documents to Kindle devices"
cask "vlc", desc: "Multimedia player"